In [1]:
import pandas as pd
import numpy as np

In [3]:
movies = pd.read_table('movies.tbl', encoding="latin-1", sep='|', header=None, names=['movie_id', 'title'], usecols=[0, 1])

In [4]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [5]:
ratings = pd.read_table('movie_ratings.tsv', sep='\t', header=None, names=['user_id', 'movie_id', 'rating', 'timestamp'])

In [6]:
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [7]:
# What movie has the highest average rating?
m = movies.merge(ratings, on='movie_id')

In [8]:
m.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

In [22]:
m.groupby('movie_id').rating.mean().reset_index().merge(movies, on='movie_id')[['title', 'rating']].sort_values(by='rating', ascending=False)

                                                  title    rating
813                       Great Day in Harlem, A (1994)  5.000000
1598                      Someone Else's America (1995)  5.000000
1200         Marlene Dietrich: Shadow and Light (1996)   5.000000
1121                     They Made Me a Criminal (1939)  5.000000
1652  Entertaining Angels: The Dorothy Day Story (1996)  5.000000
1292                                    Star Kid (1997)  5.000000
1499                          Santa with Muscles (1996)  5.000000
1188                                 Prefontaine (1997)  5.000000
1535                               Aiqing wansui (1994)  5.000000
1466               Saint of Fort Washington, The (1993)  5.000000
1448                             Pather Panchali (1955)  4.625000
118              Maya Lin: A Strong Clear Vision (1994)  4.500000
1397                                        Anna (1996)  4.500000
1641                           Some Mother's Son (1996)  4.500000
1593                                     Everest (1998)  4.500000
407                               Close Shave, A (1995)  4.491071
317                             Schindler's List (1993)  4.466443
168                          Wrong Trousers, The (1993)  4.466102
482                                   Casablanca (1942)  4.456790
113   Wallace & Gromit: The Best of Aardman Animatio...  4.447761
63                     Shawshank Redemption, The (1994)  4.445230
602                                  Rear Window (1954)  4.387560
11                           Usual Suspects, The (1995)  4.385768
49                                     Star Wars (1977)  4.358491
177                                 12 Angry Men (1957)  4.344000
512                               Third Man, The (1949)  4.333333
1190                    Letter From Death Row, A (1998)  4.333333
1638                Bitter Sugar (Azucar Amargo) (1996)  4.333333
133                                 Citizen Kane (1941)  4.292929
962             Some Folks Call It a Sling Blade (1993)  4.292683
...                                                 ...       ...
1560         Tigrero: A Film That Was Never Made (1994)  1.000000
1561       Eye of Vichy, The (Oeil de Vichy, L') (1993)  1.000000
1562             Promise, The (Versprechen, Das) (1994)  1.000000
1563                        To Cross the Rubicon (1991)  1.000000
1600                               Office Killer (1997)  1.000000
1307                                   Babyfever (1994)  1.000000
1308                       Very Natural Thing, A (1974)  1.000000
1319                                      Homage (1995)  1.000000
1324                                      August (1996)  1.000000
1586                      Terror in a Texas Town (1958)  1.000000
1585                              Lashou shentan (1992)  1.000000
1328                               Low Life, The (1994)  1.000000
1583                     Symphonie pastorale, La (1946)  1.000000
1582               Invitation, The (Zaproszenie) (1986)  1.000000
1581                                       T-Men (1947)  1.000000
1580                      Woman in Question, The (1950)  1.000000
1578                                 Baton Rouge (1988)  1.000000
1576  Death in the Garden (Mort en ce jardin, La) (1...  1.000000
1575                     Hungarian Fairy Tale, A (1987)  1.000000
1574      I, Worst of All (Yo, la peor de todas) (1990)  1.000000
1573                              Pharaoh's Army (1995)  1.000000
1571                     Wend Kuuni (God's Gift) (1982)  1.000000
1570          Touki Bouki (Journey of the Hyena) (1973)  1.000000
1569                             Quartier Mozart (1992)  1.000000
1568           Vie est belle, La (Life is Rosey) (1987)  1.000000
1567                       Vermont Is For Lovers (1992)  1.000000
1566                                     Careful (1992)  1.000000
1565                    Man from Down Under, The (1943)  1.000000
1564                                       Daens (1992)  1.000000
851                            Bloody Child, The (1996)  1.000000

[1682 rows x 2 columns]

In [27]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 2 columns):
movie_id    1682 non-null int64
title       1682 non-null object
dtypes: int64(1), object(1)
memory usage: 26.4+ KB

In [28]:
## Add a new row with no ratings
movies.loc[movies.index.max()+1] = [1 + movies.movie_id.max(), "A Movie With No Reviews"]

In [31]:
movies.tail()

      movie_id                                      title
1678      1679                           B. Monkey (1998)
1679      1680                       Sliding Doors (1998)
1680      1681                        You So Crazy (1994)
1681      1682  Scream of Stone (Schrei aus Stein) (1991)
1682      1683                    A Movie With No Reviews

In [26]:
sum(mm.rating.isnull())

0

In [32]:
## Now consider movies and number of reviews.  What's the problem?
mm = movies.merge(ratings, on='movie_id', how='left')

In [35]:
mm[mm.title == "A Movie With No Reviews"]

        movie_id                    title  user_id  rating  timestamp
100000      1683  A Movie With No Reviews      NaN     NaN        NaN

In [37]:
## How many movies have no ratings?
mm[pd.isnull(mm.rating)]

        movie_id                    title  user_id  rating  timestamp
100000      1683  A Movie With No Reviews      NaN     NaN        NaN